export const UPLOAD_FILE_1 = [
  {
    name: '1) หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
    files: [],
  },
  {
    name: '2) มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
    files: [],
  },
  {
    name: '3) แบบรายงานข้อมูลเพื่อการรับรองปริญญาตรีทางการศึกษา',
    key: 3,
    files: [],
  },
  {
    name: '4) รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
    key: 4,
    files: [],
  },
  {
    name: '5) เอกสารการผ่าน สป.อว. (กรณีผ่านแล้ว)',
    key: 5,
    files: [],
  },
  {
    name: '6) อื่นๆ (ถ้ามี) (pdf. ไม่เกิน 2 MB 1 ไฟล์) (ตามไฟล์ข้อ 3 หัวข้อ 2.1 หน่วยงานที่รับผิดชอบหลักสูตรผลิตครู)',
    key: 6,
    files: [],
  },
  {
    name: '7) เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
    key: 7,
    files: [],
  },
  {
    name: '8) เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (2)',
    key: 8,
    files: [],
  },
  {
    name: '9) ข้อมูล/เอกสารหลักฐานที่สถาบันจัดส่งเพิ่มเติมตามมติคณะอนุกรรมการ (รอบที่ 1)',
    key: 9,
    files: [],
  },
];

export const UPLOAD_FILE_2 = [
  {
    name: '1) หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
    files: [],
  },
  {
    name: '2) มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
    files: [],
  },
  {
    name: '3) แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
    key: 3,
    files: [],
  },
  {
    name: '4) ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
    key: 4,
    files: [],
  },
  { 
    name: '5) คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร', 
    key: 5, 
    files: [] 
  },
  {
    name: '6) เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
    key: 6,
    files: [],
  },
  { 
    name: '7) เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)', 
    key: 7, 
    files: [] 
  },
  {
    name: '8) ข้อมูล/เอกสารหลักฐานที่สถาบันจัดส่งเพิ่มเติมตามมติคณะอนุกรรมการ (รอบที่ 1)',
    key: 8,
    files: [],
  },
];

export const UPLOAD_FILE_3 = [
  {
    name: '1) หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
    files:[]
  },
  {
    name: '2) มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
    files:[]
  },
  {
    name: '3) แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
    key: 3,
    files:[]
  },
  {
    name: '4) ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
    key: 4,
    files:[]
  },
  {
    name: '5) คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
    key: 5,
    files:[]
  },
  {
    name: '6) เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
    key: 6,
    files:[]
  },
  {
    name: '7) รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
    key: 7,
    files:[]
  },
  {
    name: '8) เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
    key: 8,
    files:[]
  },
];

export const UPLOAD_FILE_4 = [
  {
    name: '1) หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
    files: [],
  },
  {
    name: '2) มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
    files: [],
  },
  {
    name: '3) แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
    key: 3,
    files: [],
  },
  {
    name: '4) ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
    key: 4,
    files: [],
  },
  {
    name: '5) คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
    key: 5,
    files: [],
  },
  {
    name: '6) เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
    key: 6,
    files: [],
  },
  {
    name: '7) รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
    key: 7,
    files: [],
  },
  {
    name: '8) เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
    key: 8,
    files: [],
  },
];
export const UPLOAD_FILE_5 = [
  {
    name: '1) หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
    files: [],
  },
  {
    name: '2) มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
    files: [],
  },
  {
    name: '3) แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
    key: 3,
    files: [],
  },
  {
    name: '4) ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
    key: 4,
    files: [],
  },
  {
    name: '5) คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
    key: 5,
    files: [],
  },
  {
    name: '6) เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
    key: 6,
    files: [],
  },
  {
    name: '7) รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
    key: 7,
    files: [],
  },
  {
    name: '8) เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
    key: 8,
    files: [],
  },
];
