export const REPORT_TYPE : {[index: string]:any} = {
            ADMISSION : 'admission'
}

export const REPORT_HEADER_TABLE : {[index: string]:any} = {
            admission : "รายงานรายชื่อผู้เข้าศึกษา"
}
// -----------------------------------------------------------------------------------

export const REPORT_ADMISSION_COLS = [
    "ลำดับที่"
    ,"เลขที่ส่งข้อมูลหรือเลขที่คำขอ"
    ,"รหัสนักศึกษา"
    ,"เลขที่ประจำตัวบัตรประชาชน/เลข13หลัก"
    ,"สัญชาติ"
    ,"คำนำหน้าชื่อ"
    ,"ชื่อ"
    ,"สกุล"
    ,"คำนำหน้าชื่อ(EN)"
    ,"ชื่อ(EN)"
    ,"สกุล(EN)"
    ,"วันที่เข้าศึกษา"
    ,"สถานะภาพนักศึกษา"
    ,"ชื่อสถาบัน"
    ,"หลักสูตร/ปริญญา"
    ,"สาขาวิชา"
    ,"วิชาเอก"
    ,"แขนงวิชา"
] 
// -----------------------------------------------------------------------------------

export const REPORT_COLS    :  { [index: string] : any[any] }= {
            admission : REPORT_ADMISSION_COLS
}

// -----------------------------------------------------------------------------------
export const STUDENT_STATUS :  { [index: string] : any[any] }= {
     "1" : 'คงสภาพนักศึกษา'
    ,"2" : 'พ้นสภาพนักศึกษา'
}
// -----------------------------------------------------------------------------------
export const PREFIX_TH      :  { [index: string] : any[any] }= {
                        '1' : 'นาย',
                        '2' : 'นาง',
                        '3' : 'นางสาว',
                        '4' : 'นางหรือนางสาว',
                        '5' : 'ท่านผู้หญิง',
                        '6' : 'หม่อมหลวง',
                        '7' : 'หม่อมราชวงศ์',
                        '8' : 'หม่อมเจ้า'
}
// -----------------------------------------------------------------------------------
export const PREFIX_EN      :  { [index: string] : any[any] }= {
                        '1' : 'MR.',
                        '2' : 'MRS.',
                        '3' : 'MISS.',
                        '4' : 'MS.',
                        '5' : 'LADY',
                        '6' : 'M.L.',
                        '7' : 'M.R.',
                        '8' : 'M.C.'
}